#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
//int main()
//{
//	float a = 6.0 / 5.0;
//	printf("%f\n", a);
//	return 0;
//}
//int main()
//{
//	int a = 2;
//	int b = a << 1;//a的二进制位向左移一位
//	printf("b= %d\n", b);
//	return 0;
//}
//int main()
//{
//	int a = -10;
//	int b = a >> 1;//a的二进制位向右移一位，算术右移，补原位
//	printf("b= %d\n", b);
//	return 0;
//}

//int main()
//{
//	int a = 3;
//	int b = 5;
//	//int c = a & b;//按（二进制）位与
//	////000000000000000000000011
//	////000000000000000000000101
//	////000000000000000000000001
//	//printf("%d\n", c);
//
//	//int c = a | b;//按（二进制）位或
//	////000000000000000000000011
//	////000000000000000000000101
//	////000000000000000000000111
//	//printf("%d\n", c);
//
//	int c = a ^ b;//按（二进制）位异或 不同为1相同为0
//	////000000000000000000000011
//	////000000000000000000000101
//	////000000000000000000000110
//	printf("%d\n", c);
//
//	return 0;
//}
//不创建第三个变量交换2个数的值
//int mian()
//{
//	int a = 2;
//	int b = 4;
//	/*a = a + b;
//	b = a - b;
//	a = a - b;*/ //如果数值过大会溢出
//	a = a ^ b;
//	b = a ^ b;
//	a = a ^ b;
//	//010 110 100
//	//100 010
//	return 0;
//}
